Public Member Functions | List of all members
API_IObjectEventHandler Class Reference
Notifications Manager
Defining an interface for Object event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IObjectEventHandler:
 Public Member Functions
virtual  | ~API_IObjectEventHandler ()=default
virtual void  | OnCreated (const GS::HashSet< API_Guid > &) const
virtual void  | OnModified (const GS::HashSet< API_Guid > &) const
virtual void  | OnDeleted (const GS::HashSet< API_Guid > &) const
Detailed Description
Defining an interface for Object event handlers.
Since
Archicad 26
Constructor & Destructor Documentation
◆ ~API_IObjectEventHandler()
 virtual API_IObjectEventHandler::~API_IObjectEventHandler  |  ( |   | )
virtualdefault
Member Function Documentation
◆ OnCreated()
 virtual void API_IObjectEventHandler::OnCreated  |  ( |  const GS::HashSet< API_Guid > &  |   | ) |   const
inlinevirtual
◆ OnDeleted()
 virtual void API_IObjectEventHandler::OnDeleted  |  ( |  const GS::HashSet< API_Guid > &  |   | ) |   const
inlinevirtual
◆ OnModified()
 virtual void API_IObjectEventHandler::OnModified  |  ( |  const GS::HashSet< API_Guid > &  |   | ) |   const
inlinevirtual